Pandas Indexing and Slicing

In Pandas, 
indexing refers to accessing rows and columns of data from a DataFrame, 
whereas slicing refers to accessing a range of rows and columns.

We can access data or range of data from a DataFrame using different methods.

Access Columns of a DataFrame

In [2]:
import pandas as pd
data = {'Name': ['Abu Bakar', 'Bilal', 'Hassan', 'Alex', 'Mitchel Starc'],
        'Age': [25, 22, 17, 32, 35],
        'City': ['Berlin', 'Karachi', 'Hamburg', 'Berlin', 'Sydney']}
df = pd.DataFrame(data)

In [3]:
df

            Name  Age     City
0      Abu Bakar   25   Berlin
1          Bilal   22  Karachi
2         Hassan   17  Hamburg
3           Alex   32   Berlin
4  Mitchel Starc   35   Sydney

In [4]:
df['Name']

0        Abu Bakar
1            Bilal
2           Hassan
3             Alex
4    Mitchel Starc
Name: Name, dtype: object

In [5]:
df[['Name', 'City']]

            Name     City
0      Abu Bakar   Berlin
1          Bilal  Karachi
2         Hassan  Hamburg
3           Alex   Berlin
4  Mitchel Starc   Sydney

.loc vs .iloc

The main differences between .loc and .iloc are as follows:

Basis	                 .loc	                           .iloc
Indexing	        Label-based indexing	        Integer-based indexing
Endpoint	        Endpoint is included	        Endpoint is not included
Boolean indexing	Boolean indexing is supported	Boolean indexing is not supported

Pandas .loc

In Pandas, we use the .loc property to access and modify data within a DataFrame using label-based indexing.

It allows us to select specific rows and columns based on their labels.

Syntax
The syntax of .loc in Pandas is:

df.loc[row_indexer, column_indexer]

In [14]:
# access a single row
singleRow = df.loc[2]

print("Single row:")
print(singleRow)
print()

Single row:
Name     Hassan
Age          17
City    Hamburg
Name: 2, dtype: object

In [18]:
# access rows 0, 3 and 4
rowList = df.loc[[0, 3, 4]]

print("List of Rows:")
print(rowList)
print()

List of Rows:
            Name  Age    City
0      Abu Bakar   25  Berlin
3           Alex   32  Berlin
4  Mitchel Starc   35  Sydney

In [23]:
df.loc[:,['Name','City']]

            Name     City
0      Abu Bakar   Berlin
1          Bilal  Karachi
2         Hassan  Hamburg
3           Alex   Berlin
4  Mitchel Starc   Sydney

In [24]:
 df.loc[1:3]

     Name  Age     City
1   Bilal   22  Karachi
2  Hassan   17  Hamburg
3    Alex   32   Berlin

In [27]:
 df.loc[:, "Name":"Age"]

            Name  Age
0      Abu Bakar   25
1          Bilal   22
2         Hassan   17
3           Alex   32
4  Mitchel Starc   35

In [30]:
df.loc[df["Age"]>30]

            Name  Age    City
3           Alex   32  Berlin
4  Mitchel Starc   35  Sydney

In [31]:
df.iloc[1]

Name      Bilal
Age          22
City    Karachi
Name: 1, dtype: object

In [32]:
df.iloc[1:3]

     Name  Age     City
1   Bilal   22  Karachi
2  Hassan   17  Hamburg

In [34]:
df.iloc[:,[0,2]]

            Name     City
0      Abu Bakar   Berlin
1          Bilal  Karachi
2         Hassan  Hamburg
3           Alex   Berlin
4  Mitchel Starc   Sydney

In [43]:
df.iloc[:,[0,2]]

            Name     City
0      Abu Bakar   Berlin
1          Bilal  Karachi
2         Hassan  Hamburg
3           Alex   Berlin
4  Mitchel Starc   Sydney

In [51]:
df.iloc[[1,4],:]

            Name  Age     City
1          Bilal   22  Karachi
4  Mitchel Starc   35   Sydney